import { Box, Container, Heading, } from '@chakra-ui/react';
import {Flex, Image, Text} from '@chakra-ui/react';
import React from 'react';
import Sertificate from '../../assets/Sertifikat.png';

function Sertification() {
  return (
    <>
      <Container maxW='1100px' p='2rem 0'>
          <Flex justify={['center', 'center', 'space-between']} direction={['column', 'column', 'row']}>
            <Box className='sertificate__image' w={['90%', '65%', '40%']} m={['0 auto', '0 auto', '0']}>
              <Image src={Sertificate} w='100%' />
            </Box>
            <Box w={['90%', '90%', '55%']} m={['0 auto', '0 auto', '0']}>
              <Heading textAlign='center' mb='1rem' fontSize={['1.5rem', '1.5rem', '2rem']}>“КОРРУПЦИЯСИЗ КЕЛАЖАК”</Heading>
              <Text textAlign={['center', 'center', 'start']}>“КОРРУПЦИЯСИЗ КЕЛАЖАК” Коррупцияга қарши курашиш жамоат бирлашмаси (ННТ) Ўзбекистон Республикасининг “Нодавлат нотижорат ташкилотлари тўғрисида” ги, “Жамоат бирлашмалари тўғрисида” ги, “Коррупцияга қарши курашиш тўғрисида” ги Қонунлари асосида ҳамда ўз Уставига мувофиқ фаолият юритувчи ташкилот – юридик шахсдир. Ташкилот жамиятимиздаги коррупция иллатига қарши кураш мақсадида ўзларининг ҳоҳиш иродалари ҳамоханглиги, ягона ғоя атрофида бирлашиш иштиёқлари, шижоатлари якдиллиги оқибатида ташкил этилган жамоатчилик вакиллари бирлашувининг расмий кўринишидир. Жамиятимизда авж олиб бораётган коррупциянинг хар қандай кўринишига эътирозини, нафратини изхор қилишга интилаётган республикамизнинг турли вилоятларида истиқомат қилувчи жамоатчилик фаоллари, турли соҳа вакиллари коррупцияга қарши курашда ягона куч сифатида бирлашиб 16.09.2022 йилда жамоат бирлашмаси ташаббускор гурухи аъзоларининг умумий йиғилишини ўтказдилар. Ушбу йиғилиш аъзолари бир овоздан коррупцияга қарши курашиш жамоат бирлашмаси (НТТ) ташкил этилганлиги ҳақида қарор қабул қилдилар ва бу нодавлат нотижора ташкилотини “КОРРУПЦИЯСИЗ КЕЛАЖАК” деб номладилар. Йиғилишда ташкилот Устави қабул қилинди ва рахбар органлари тасдиқланди. Бошқарув кенгаши аъзолари талаб қилинган хужжатларни жамлаб 2022 йилнинг 07 октябрида ташкилотни давлат рўйхатидан ўтказиш учун Ўзбекистон Республикаси Адлия вазирлигига расман мурожаат қилиб ариза топширдилар. Тақдим қилинган хужжатлар белгиланган тартибда ўрганиб чиқилиб “КОРРУПЦИЯСИЗ КЕЛАЖАК” жамоат бирлашмаси 04.11.2022 йилда Адлия вазирлигида давлат рўйхатидан ўтказилди ва ташкилотга Нодавлат нотижорат ташкилотини давлат рўйхатидан ўтказилганлиги ҳақида Адлия вазирлигидан 1048-сонли гувоҳнома берилди. Ташкилот фаолиятининг асосий мақсади – кенг жамоатчилик орасида коррупция ва коррупцион холатларга нисбатан муросасиз муносабатни шакллантириш, ўз аъзолари ва жамият аъзоларининг бу борадаги қонуний ҳуқуқ ҳамда манфаатларини ҳимоя қилиш. Мақсадни амалга ошириш учун ташкилот давлат, давлат органлари, ҳуқуқни муҳофаза қилувчи органлар марказий махкамалари билан бевосита ҳамкорлик қилади. Шунингдек жисмоний ва юридик шахсларнинг коррупция ва коррупцион холатлар ҳақидаги маълумотларини қабул қилади, ўрганиб чиқади, коррупцияга нисбатан курашда ҳуқуқни муҳофаза қилувчи органлар марказий маҳкамалари билан яқин алоқалар ўрнатади. Коррупцияга дуч келган, ундан бевосита жабр кўрган шахслар ҳуқуқларини тиклашга ва зарур холларда уларнинг манфаатларини давлат органларида, судларда, корхона, муассаса, ташкилотларда, шунингдек нодавлат секторда ҳимоя қилишга доир харакатларни амалга оширади.</Text>
            </Box>
          </Flex>
      </Container>
    </>
  )
}

export default Sertification